In [1]:
import pandas as pd

In [22]:
fName = "running.csv"
df = pd.read_csv(fName)
print(">> 100미터 달리기 기록데이터 모두 출력")
df.head()

>> 100미터 달리기 기록데이터 모두 출력

       아이디   이름   성별    연령     1차     2차     3차
0  P330531  이겨레    남  26.0  13.25    NaN    NaN
1  P340037  조약돌  NaN  25.0    NaN    NaN  16.33
2  P194563  강산애    남   NaN  12.84  12.66    NaN
3  P503546  원미연    여  48.0    NaN  18.05    NaN
4  P330543  오대양    남  31.0  15.23    NaN    NaN

In [4]:
print("데이터 프레임 요약 정보 출력")
df.info()

데이터 프레임 요약 정보 출력
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   아이디     10 non-null     object
 1   이름      10 non-null     object
 2   성별      8 non-null      object
 3   연령      8 non-null      float64
 4   1차      6 non-null      float64
 5   2차      5 non-null      float64
 6   3차      3 non-null      float64
dtypes: float64(4), object(3)
memory usage: 688.0+ bytes

In [5]:
# value_counts() : 데이터 프레임에 누락된 데이터의 갯수를 정확하게 파악
# dropna = False : NaN 값을 포함한 누락된 데이터 개수
# dropna = True : NaN 값을 제외한 데이터 개수(default)
print(">> 연령 열에 NaN 값이 포함되어 누락된 데이터 개수 계산하여 출력")
df['연령'].value_counts() # dropna=False

>> 연령 열에 NaN 값이 포함되어 누락된 데이터 개수 계산하여 출력

26.0    1
25.0    1
48.0    1
31.0    1
45.0    1
53.0    1
19.0    1
64.0    1
Name: 연령, dtype: int64

In [6]:
df['연령'].value_counts(dropna=False)

NaN     2
26.0    1
25.0    1
48.0    1
31.0    1
45.0    1
53.0    1
19.0    1
64.0    1
Name: 연령, dtype: int64

In [24]:
df

       아이디   이름   성별    연령     1차     2차     3차
0  P330531  이겨레    남  26.0  13.25    NaN    NaN
1  P340037  조약돌  NaN  25.0    NaN    NaN  16.33
2  P194563  강산애    남   NaN  12.84  12.66    NaN
3  P503546  원미연    여  48.0    NaN  18.05    NaN
4  P330543  오대양    남  31.0  15.23    NaN    NaN
5  P341257  송가인    여  45.0  18.98  18.75    NaN
6  P472358  성공찬    여  53.0    NaN    NaN  16.07
7  P340037  조약돌    여   NaN  16.99  16.74    NaN
8  P232305  신영웅  NaN  19.0    NaN  13.33    NaN
9  P489602  최고봉    남  64.0  20.23    NaN  23.57

In [25]:
# 도전문제] 1차,2차,3차 열에 NaN값을 포함한 데이터 개수를 추출
df['1차'].value_counts(dropna=False)

NaN      4
13.25    1
12.84    1
15.23    1
18.98    1
16.99    1
20.23    1
Name: 1차, dtype: int64

In [19]:
df['2차'].value_counts(dropna=False)

NaN      5
12.66    1
18.05    1
18.75    1
16.74    1
13.33    1
Name: 2차, dtype: int64

In [26]:
# 누락 데이터를 열의 평균값으로 치환
# fillna() : 누락된 데이터의 값을 유요한 값으로 대체(inplace = True:원본 변경)
df2 = df.copy() # 원본 df
# 연령 열의 누락된 데이터를 평균값으로 치환하기 전
print(df2['연령'].head())
# df2.fillna(평균값, inplace=True)

0    26.0
1    25.0
2     NaN
3    48.0
4    31.0
Name: 연령, dtype: float64

In [27]:
# 연령 열의 누락된 데이터를 평균값으로 치환하기 후
ageMean = df2['연령'].mean(axis=0) # 열기준
df2.fillna(ageMean, inplace=True)
print(df2['연령'].head())

0    26.000
1    25.000
2    38.875
3    48.000
4    31.000
Name: 연령, dtype: float64

In [29]:
df2 = df.copy()
df2.set_index("이름",inplace=True)
df2.head(3)

         아이디   성별    연령     1차     2차     3차
이름
이겨레  P330531    남  26.0  13.25    NaN    NaN
조약돌  P340037  NaN  25.0    NaN    NaN  16.33
강산애  P194563    남   NaN  12.84  12.66    NaN

In [30]:
print(">> 조약돌의 누락된 성별 데이터를 특정 값으로 치환")
df2.loc["조약돌","성별"] = "여"
df2.head(3)

>> 조약돌의 누락된 성별 데이터를 특정 값으로 치환

         아이디 성별    연령     1차     2차     3차
이름
이겨레  P330531  남  26.0  13.25    NaN    NaN
조약돌  P340037  여  25.0    NaN    NaN  16.33
강산애  P194563  남   NaN  12.84  12.66    NaN

In [33]:
# 누락 데이터를 이웃 행의 데이터 값으로 치환 
# 0 앞, 뒤, 주위값
df2 = df.copy()
df2.iloc[:,4:].head()

      1차     2차     3차
0  13.25    NaN    NaN
1    NaN    NaN  16.33
2  12.84  12.66    NaN
3    NaN  18.05    NaN
4  15.23    NaN    NaN

In [35]:
print(">> 누락된 값을 0으로 치환")
df2.fillna(0).iloc[:,4:].head()

>> 누락된 값을 0으로 치환

      1차     2차     3차
0  13.25   0.00   0.00
1   0.00   0.00  16.33
2  12.84  12.66   0.00
3   0.00  18.05   0.00
4  15.23   0.00   0.00

In [36]:
print(">> 누락된 값을 앞 행의 치환")
df2.fillna(method='ffill').iloc[:,4:].head()

>> 누락된 값을 앞 행의 치환

      1차     2차     3차
0  13.25    NaN    NaN
1  13.25    NaN  16.33
2  12.84  12.66  16.33
3  12.84  18.05  16.33
4  15.23  18.05  16.33

In [37]:
print(">> 누락된 값을 앞 행의 치환")
df2.fillna(method='bfill').iloc[:,4:]

>> 누락된 값을 앞 행의 치환

      1차     2차     3차
0  13.25  12.66  16.33
1  12.84  12.66  16.33
2  12.84  12.66  16.07
3  15.23  18.05  16.07
4  15.23  18.75  16.07
5  18.98  18.75  16.07
6  16.99  16.74  16.07
7  16.99  16.74  23.57
8  20.23  13.33  23.57
9  20.23    NaN  23.57

In [39]:
print(">> 누락된 값을 양쪽 행의 치환")
df2.interpolate().iloc[:,4:]

>> 누락된 값을 양쪽 행의 치환

       1차      2차      3차
0  13.250     NaN     NaN
1  13.045     NaN  16.330
2  12.840  12.660  16.278
3  14.035  18.050  16.226
4  15.230  18.400  16.174
5  18.980  18.750  16.122
6  17.985  17.745  16.070
7  16.990  16.740  18.570
8  18.610  13.330  21.070
9  20.230  13.330  23.570

In [47]:
print("각 열에 누락 된 데이터의 개수 확인")
nanDf = df.isnull()
nanDf.head()

각 열에 누락 된 데이터의 개수 확인

     아이디     이름     성별     연령     1차     2차     3차
0  False  False  False  False  False   True   True
1  False  False   True  False   True   True  False
2  False  False  False   True  False  False   True
3  False  False  False  False   True  False   True
4  False  False  False  False  False   True   True

In [43]:
print("데이터 총 개수 :", len(df2.index))
for col in nanDf.columns:
    # 각 열에 존재하는 NaN 개수 파악
    nanCnt = nanDf[col].value_counts()
    try:
        # NaN 값이 존재하면 개수 출력
        print(col, ":", nanCnt[True])
    except:
        # NaN 값이 존재하지 않으면 0개 출력
        print(col,":",0)

데이터 총 개수 : 10
아이디 : 0
이름 : 0
성별 : 2
연령 : 2
1차 : 4
2차 : 5
3차 : 7

In [ ]:
df2 = df.copy()
print(">> 유")

In [49]:
# 누락 데이터가 존재하는 열 삭제
print(">> 유효한 데이터가 6개 이상")
print("존재하지 않은 열 전체 삭제")
# axis = 1열
df2 = df2.dropna(axis=0,thresh=6)
df2

>> 유효한 데이터가 4개 이상
존재하지 않은 열 전체 삭제

       아이디   이름 성별    연령     1차     2차     3차
5  P341257  송가인  여  45.0  18.98  18.75    NaN
9  P489602  최고봉  남  64.0  20.23    NaN  23.57

In [50]:
import numpy as np
df2 = df.copy()
df2["4차"] = np.nan
df2.loc[len(df2.index)] = np.nan
df2

        아이디   이름   성별    연령     1차     2차     3차  4차
0   P330531  이겨레    남  26.0  13.25    NaN    NaN NaN
1   P340037  조약돌  NaN  25.0    NaN    NaN  16.33 NaN
2   P194563  강산애    남   NaN  12.84  12.66    NaN NaN
3   P503546  원미연    여  48.0    NaN  18.05    NaN NaN
4   P330543  오대양    남  31.0  15.23    NaN    NaN NaN
5   P341257  송가인    여  45.0  18.98  18.75    NaN NaN
6   P472358  성공찬    여  53.0    NaN    NaN  16.07 NaN
7   P340037  조약돌    여   NaN  16.99  16.74    NaN NaN
8   P232305  신영웅  NaN  19.0    NaN  13.33    NaN NaN
9   P489602  최고봉    남  64.0  20.23    NaN  23.57 NaN
10      NaN  NaN  NaN   NaN    NaN    NaN    NaN NaN

In [51]:
# 모두 NaN의 값으로 구성된 행 삭제
df2 = df.dropna(axis=0, how='all')
df2.tail()

       아이디   이름   성별    연령     1차     2차     3차
5  P341257  송가인    여  45.0  18.98  18.75    NaN
6  P472358  성공찬    여  53.0    NaN    NaN  16.07
7  P340037  조약돌    여   NaN  16.99  16.74    NaN
8  P232305  신영웅  NaN  19.0    NaN  13.33    NaN
9  P489602  최고봉    남  64.0  20.23    NaN  23.57

In [52]:
# 중복 데이터 확인
df

       아이디   이름   성별    연령     1차     2차     3차
0  P330531  이겨레    남  26.0  13.25    NaN    NaN
1  P340037  조약돌  NaN  25.0    NaN    NaN  16.33
2  P194563  강산애    남   NaN  12.84  12.66    NaN
3  P503546  원미연    여  48.0    NaN  18.05    NaN
4  P330543  오대양    남  31.0  15.23    NaN    NaN
5  P341257  송가인    여  45.0  18.98  18.75    NaN
6  P472358  성공찬    여  53.0    NaN    NaN  16.07
7  P340037  조약돌    여   NaN  16.99  16.74    NaN
8  P232305  신영웅  NaN  19.0    NaN  13.33    NaN
9  P489602  최고봉    남  64.0  20.23    NaN  23.57

In [53]:
dul_df =df.duplicated(['이름'])
dul_df

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9    False
dtype: bool

In [54]:
df2 = df.drop_duplicates(['이름'])
df2

       아이디   이름   성별    연령     1차     2차     3차
0  P330531  이겨레    남  26.0  13.25    NaN    NaN
1  P340037  조약돌  NaN  25.0    NaN    NaN  16.33
2  P194563  강산애    남   NaN  12.84  12.66    NaN
3  P503546  원미연    여  48.0    NaN  18.05    NaN
4  P330543  오대양    남  31.0  15.23    NaN    NaN
5  P341257  송가인    여  45.0  18.98  18.75    NaN
6  P472358  성공찬    여  53.0    NaN    NaN  16.07
8  P232305  신영웅  NaN  19.0    NaN  13.33    NaN
9  P489602  최고봉    남  64.0  20.23    NaN  23.57